/**
 * Created by syzx9801@163.com on 2017/7/25.
 */
export const demo = {
    color: ['#C1232B','#B5C334','#FCCE10','#E87C25','#27727B',
        '#FE8463','#9BCA63','#FAD860','#F3A43B','#60C0DD',
        '#D7504B','#C6E579','#F4E001','#F0805A','#26C0C0'],
    map1:{
        map1:[
            {name:'OTT',value:'11940'},
            {name: 'IDC',value: '8029'},
            {name: 'CDN',value: '14273'},
            {name: 'CACHE',value: '11278'},
        ],
        map2:[
            {name:'OTT',value:'77.8'},
            {name: 'IDC',value: '76.4'},
            {name: 'CDN',value: '32'},
            {name: 'CACHE',value: '68.4'}
        ],
        map3:[8.8,16.9,2.7,3.1],
        map4 : [
            {
                name:'安徽',
                value:{
                    CDN:209.35,
                    IDC:873.83,
                    Cache:112.08,
                    PCache:17.94,
                }
            },
            {
                name: '北京',
                value:{
                    CDN:42.82,
                    IDC:482.21,
                    Cache:38.87,
                    PCache:0,
                }
            },
            {
                name: '福建',
                value:{
                    CDN:163.74,
                    IDC:425.08,
                    Cache:148.59,
                    PCache:14.62,
                }
            },
            {
                name: '甘肃',
                value:{
                    CDN:210.63,
                    IDC:77.16,
                    Cache:44.41,
                    PCache:0,
                }
            },
            {
                name: '广东',
                value:{
                    CDN:576.33,
                    IDC:1837.92,
                    Cache:169.561,
                    PCache:47.4,
                }
            },
            {
                name: '贵州',
                value:{
                    CDN:335.13,
                    IDC:112.41,
                    Cache:129.81,
                    PCache:20.49,
                }
            },
            {
                name: '广西',
                value:{
                    CDN:222.54,
                    IDC:106.77,
                    Cache:110.25,
                    PCache:0,
                }
            },
            {
                name: '海南',
                value:{
                    CDN:35.39,
                    IDC:43.22,
                    Cache:33.63,
                    PCache:0,
                }
            },
            {
                name: '河北',
                value:{
                    CDN:379.81,
                    IDC:305.51,
                    Cache:96.76,
                    PCache:86.56,
                }
            },
            {
                name: '河南',
                value:{
                    CDN:334.3,
                    IDC:914.04,
                    Cache:163.12,
                    PCache:1.31,
                }
            },
            {
                name: '黑龙江',
                value:{
                    CDN:53.8,
                    IDC:166.77,
                    Cache:57.33,
                    PCache:0,
                }
            },
            {
                name: '湖北',
                value:{
                    CDN:109.23,
                    IDC:503.71,
                    Cache:108.84,
                    PCache:0.25,
                }
            },
            {
                name: '湖南',
                value:{
                    CDN:463.09,
                    IDC:644.7,
                    Cache:138.21,
                    PCache:0,
                }
            },
            {
                name: '吉林',
                value:{
                    CDN:44.82,
                    IDC:149.96,
                    Cache:43.06,
                    PCache:0,
                }
            },
            {
                name: '江苏',
                value:{
                    CDN:258.48,
                    IDC:1939.95,
                    Cache:119.33,
                    PCache:0,
                }
            },
            {
                name: '江西',
                value:{
                    CDN:454.26,
                    IDC:1095.58,
                    Cache:43.27,
                    PCache:12.22,
                }
            },
            {
                name: '辽宁',
                value:{
                    CDN:101.32,
                    IDC:380.16,
                    Cache:50.35,
                    PCache:3.91,
                }
            },
            {
                name: '内蒙古',
                value:{
                    CDN:55.74,
                    IDC:51.37,
                    Cache:44.06,
                    PCache:17.1,
                }
            },
            {
                name: '宁夏',
                value:{
                    CDN:32.09,
                    IDC:8.59,
                    Cache:14.3,
                    PCache:1.95,
                }
            },
            {
                name: '青海',
                value:{
                    CDN:12.35,
                    IDC:8.15,
                    Cache:13.15,
                    PCache:14.15,
                }
            },
            {
                name: '山东',
                value:{
                    CDN:128.1,
                    IDC:1453.21,
                    Cache:89,
                    PCache:91.65,
                }
            },
            {
                name: '山西',
                value:{
                    CDN:96.56,
                    IDC:396.14,
                    Cache:45.94,
                    PCache:74.47,
                }
            },
            {
                name: '陕西',
                value:{
                    CDN:60.2,
                    IDC:95.85,
                    Cache:50.69,
                    PCache:83.23,
                }
            },
            {
                name: '上海',
                value:{
                    CDN:94.32,
                    IDC:694.92,
                    Cache:116.23,
                    PCache:0,
                }
            },
            {
                name: '四川',
                value:{
                    CDN:191.56,
                    IDC:1189.54,
                    Cache:191.18,
                    PCache:0,
                }
            },
            {
                name: '天津',
                value:{
                    CDN:22.34,
                    IDC:106.99,
                    Cache:20.62,
                    PCache:15.79,
                }
            },
            {
                name: '西藏',
                value:{
                    CDN:2.05,
                    IDC:14.28,
                    Cache:14.89,
                    PCache:0,
                }
            },
            {
                name: '新疆',
                value:{
                    CDN:63.62,
                    IDC:95.21,
                    Cache:60.09,
                    PCache:16.81,
                }
            },
            {
                name: '云南',
                value:{
                    CDN:69.46,
                    IDC:486.01,
                    Cache:49.95,
                    PCache:1137.58,
                }
            },
            {
                name: '浙江',
                value:{
                    CDN:188.63,
                    IDC:1928.1,
                    Cache:188.63,
                    PCache:0,
                }
            },
            {
                name: '重庆',
                value:{
                    CDN:277.88,
                    IDC:353.63,
                    Cache:35.63,
                    PCache:0.02,
                }
            },
        ]
    },
    colorTen:['#ff6666','#ffb54c','#f4de4a','#b7e871','#3aba70','#68c5f5','#68c5f5','#566eff','#dd56ff','#ef5e80'],
    map2:{
        map2:[
            {
                name:'腾讯',
                value:3.06,
            },
            {
                name:'爱奇艺',
                value:1.67
            }
        ],
        map4:[
            {
                name: '腾讯',
                province:[
                    {
                        name:'安徽',
                        value: 0.45
                    }
                ],
                time:[
                    {
                        name:'0:00',
                        value: 0.01
                    }
                ]
            },
            {
                name: '爱奇艺',
                province:[
                    {
                        name: '安徽',
                        value: 0.13
                    }
                ],
                time:[
                    {
                        name:'0:00',
                        value: 0.13
                    }
                ]
            },
            {
                name: '阿里巴巴',
                province:[
                    {
                        name: '安徽',
                        value: 0.13
                    }
                ],
                time:[
                    {
                        name:'0:00',
                        value: 0.13
                    }
                ]
            },
            {
                name: '优酷土豆网',
                province:[
                    {
                        name: '安徽',
                        value: 0.13
                    }
                ],
                time:[
                    {
                        name:'0:00',
                        value: 0.13
                    }
                ]
            },
            {
                name: '百度',
                province:[
                    {
                        name: '安徽',
                        value: 0.13
                    }
                ],
                time:[
                    {
                        name:'0:00',
                        value: 0.13
                    }
                ]
            },
            {
                name: '乐视网',
                province:[
                    {
                        name: '安徽',
                        value: 0.13
                    }
                ],
                time:[
                    {
                        name:'0:00',
                        value: 0.13
                    }
                ]
            },
            {
                name: '芒果TV',
                province:[
                    {
                        name: '安徽',
                        value: 0.13
                    }
                ],
                time:[
                    {
                        name:'0:00',
                        value: 0.13
                    }
                ]
            },
            {
                name: '金山网络',
                province:[
                    {
                        name: '安徽',
                        value: 0.13
                    }
                ],
                time:[
                    {
                        name:'0:00',
                        value: 0.13
                    }
                ]
            },
            {
                name: '搜狐',
                province:[
                    {
                        name: '安徽',
                        value: 0.13
                    }
                ],
                time:[
                    {
                        name:'0:00',
                        value: 0.13
                    }
                ]
            },
            {
                name: '新浪',
                province:[
                    {
                        name: '安徽',
                        value: 0.13
                    }
                ],
                time:[
                    {
                        name:'0:00',
                        value: 0.13
                    }
                ]
            }
        ],
    },
    map7:[
        {
            title: 'OTT',
            richang: 1093,
            shishi: 43.3,
            mapData: [
                {
                    title: '安徽',
                    value: 334
                }
            ]
        },
        {
            title: '腾讯视频',
            richang: 14.8,
            shishi: 17.3,
            mapData: [
                {
                    title: '安徽',
                    value: 334
                }
            ]
        },
        {
            title: '咪咕视频',
            richang: 15.8,
            shishi: 13.3,
            mapData: [
                {
                    title: '安徽',
                    value: 334
                }
            ]
        },
        {
            title: '凤凰视频',
            richang: 15.8,
            shishi: 13.3,
            mapData: [
                {
                    title: '安徽',
                    value: 334
                }
            ]
        },
        {
            title: '咪咕音乐',
            richang: 15.8,
            shishi: 13.3,
            mapData: [
                {
                    title: '安徽',
                    value: 334
                }
            ]
        },
        {
            title: '和地图',
            richang: 15.8,
            shishi: 13.3,
            danwei: 'Mbps',
            mapData: [
                {
                    title: '安徽',
                    value: 334
                }
            ]
        },
        {
            title: '移动MM',
            richang: 15.8,
            shishi: 13.3,
            danwei: 'Mbps',
            mapData: [
                {
                    title: '安徽',
                    value: 334
                }
            ]
        },
        {
            title: '139邮箱',
            richang: 15.8,
            shishi: 13.3,
            danwei: 'Mbps',
            mapData: [
                {
                    title: '安徽',
                    value: 334
                }
            ]
        },
        {
            title: '缓存流量',
            richang: 15.8,
            shishi: 13.3,
            mapData: [
                {
                    title: '安徽',
                    value: 334
                }
            ]
        },
    ]
};
export const colorD = '#1d2b46'
export const color = {'统建CDN':'#f4d45b','IDC':'#61b1ec','Cache':'#615297','省建OTT':'#ec6182'};
export const column = ["安徽", "北京", "福建", "甘肃", "广东", "贵州", "广西", "海南", "河北", "河南", "黑龙江", "湖北", "湖南", "吉林", "江苏", "江西", "辽宁", "内蒙古", "宁夏", "青海", "山东", "山西", "陕西", "上海", "四川", "天津", "西藏", "新疆", "云南", "浙江", "重庆"]
export const seller = ['腾讯','爱奇艺','阿里巴巴','优酷土豆网','百度','易视腾科技有限公司','芒果TV','搜狐','新浪']
export const timeColumn = ['0时','1时','2时','3时','4时','5时','6时','7时','8时','9时','10时','11时','12时','13时','14时','15时','16时','17时','18时','19时','20时','21时','22时','23时']
export const textStyle = {
    color:'#feffff',
    fontSize: 24,
    fontWeight: 'normal'
}
export const labelStyle = {
    textStyle:{
        color: '#feffff',
        fontSize: 14,
        fontWeight: 'normal'
    }
}
export const seriesLabelStyle = {
    textStyle:{
        color: '#feffff',
        fontSize: 14,
        fontWeight: 'normal'
    }
}
export const itemHeight = 15;
export const itemWidth =15;

export const axisLine = {
    lineStyle:{
        color:'#CFCFD9'
    }
}
export const axisLabel = {
    show:true,
    textStyle:{
        color: '#c0c6c4',
        fontSize: 14
    },
}

export const timeData = [
        {
            "name": "0:00",
            "腾讯": "0.01 ",
            "爱奇艺": "0.13 ",
            "阿里巴巴": "0.08 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.01 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.03 ",
            "金山网络":"0.00",
            "搜狐": "0.01 ",
            "新浪": "0.03 "
        },
        {
            "name": "1:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.03 ",
            "阿里巴巴": "0.12 ",
            "优酷土豆网": "0.03 ",
            "百度": "0.00 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.02 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.01 "
        },
        {
            "name": "2:00",
            "腾讯": "0.03 ",
            "爱奇艺": "0.00 ",
            "阿里巴巴": "0.00 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.00 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.01 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "3:00",
            "腾讯": "0.04 ",
            "爱奇艺": "0.02 ",
            "阿里巴巴": "0.00 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.00 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.05 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "4:00",
            "腾讯": "0.05 ",
            "爱奇艺": "0.02 ",
            "阿里巴巴": "0.10 ",
            "优酷土豆网": "0.14 ",
            "百度": "0.06 ",
            "乐视网": "0.04 ",
            "芒果TV": "0.06 ",
            "金山网络":"0.00",
            "搜狐": "0.01 ",
            "新浪": "0.01 "
        },
        {
            "name": "5:00",
            "腾讯": "0.06 ",
            "爱奇艺": "0.00 ",
            "阿里巴巴": "0.00 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.01 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "6:00",
            "腾讯": "0.07 ",
            "爱奇艺": "0.01 ",
            "阿里巴巴": "0.00 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.00 ",
            "乐视网": "0.03 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "7:00",
            "腾讯": "0.08 ",
            "爱奇艺": "0.00 ",
            "阿里巴巴": "0.02 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.01 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "8:00",
            "腾讯": "0.09 ",
            "爱奇艺": "0.14 ",
            "阿里巴巴": "0.11 ",
            "优酷土豆网": "0.13 ",
            "百度": "0.05 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.03 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "9:00",
            "腾讯": "0.12 ",
            "爱奇艺": "0.04 ",
            "阿里巴巴": "0.04 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.00 ",
            "乐视网": "0.02 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "10:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.05 ",
            "阿里巴巴": "0.00 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.00 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "11:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.00 ",
            "阿里巴巴": "0.01 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.00 ",
            "乐视网": "0.04 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "12:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.01 ",
            "阿里巴巴": "0.02 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.07 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "13:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.13 ",
            "阿里巴巴": "0.06 ",
            "优酷土豆网": "0.18 ",
            "百度": "0.03 ",
            "乐视网": "0.03 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.01 "
        },
        {
            "name": "14:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.01 ",
            "阿里巴巴": "0.00 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.02 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "15:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.05 ",
            "阿里巴巴": "0.00 ",
            "优酷土豆网": "0.05 ",
            "百度": "0.04 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "16:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.00 ",
            "阿里巴巴": "0.00 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.12 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "17:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.10 ",
            "阿里巴巴": "0.03 ",
            "优酷土豆网": "0.08 ",
            "百度": "0.14 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.01 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "18:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.00 ",
            "阿里巴巴": "0.00 ",
            "优酷土豆网": "0.01 ",
            "百度": "0.00 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "19:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.00 ",
            "阿里巴巴": "0.00 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.00 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "20:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.00 ",
            "阿里巴巴": "0.02 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.04 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "21:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.08 ",
            "阿里巴巴": "0.06 ",
            "优酷土豆网": "0.03 ",
            "百度": "0.00 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "22:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.00 ",
            "阿里巴巴": "0.05 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.01 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        },
        {
            "name": "23:00",
            "腾讯": "0.02 ",
            "爱奇艺": "0.01 ",
            "阿里巴巴": "0.00 ",
            "优酷土豆网": "0.00 ",
            "百度": "0.00 ",
            "乐视网": "0.00 ",
            "芒果TV": "0.00 ",
            "金山网络":"0.00",
            "搜狐": "0.00 ",
            "新浪": "0.00 "
        }
    ]

export const provinceData = [
    {
        "name": "安徽",
        "腾讯": "0.45 ",
        "爱奇艺": "0.13 ",
        "阿里巴巴": "0.08 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.01 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.01 ",
        "新浪": "0.01 "
    },
    {
        "name": "北京",
        "腾讯": "0.14 ",
        "爱奇艺": "0.03 ",
        "阿里巴巴": "0.12 ",
        "优酷土豆网": "0.03 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.01",
        "搜狐": "0.00 ",
        "新浪": "0.01 "
    },
    {
        "name": "福建",
        "腾讯": "0.00 ",
        "爱奇艺": "0.00 ",
        "阿里巴巴": "0.00 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.02",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "甘肃",
        "腾讯": "0.04 ",
        "爱奇艺": "0.02 ",
        "阿里巴巴": "0.00 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.08",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "广东",
        "腾讯": "0.45 ",
        "爱奇艺": "0.02 ",
        "阿里巴巴": "0.10 ",
        "优酷土豆网": "0.14 ",
        "百度": "0.06 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.04",
        "搜狐": "0.01 ",
        "新浪": "0.01 "
    },
    {
        "name": "广西",
        "腾讯": "0.00 ",
        "爱奇艺": "0.00 ",
        "阿里巴巴": "0.00 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.01 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "贵州",
        "腾讯": "0.00 ",
        "爱奇艺": "0.00 ",
        "阿里巴巴": "0.00 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.01 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "海南",
        "腾讯": "0.00 ",
        "爱奇艺": "0.01 ",
        "阿里巴巴": "0.00 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "河北",
        "腾讯": "0.00 ",
        "爱奇艺": "0.00 ",
        "阿里巴巴": "0.02 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.01 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "河南",
        "腾讯": "0.15 ",
        "爱奇艺": "0.14 ",
        "阿里巴巴": "0.11 ",
        "优酷土豆网": "0.13 ",
        "百度": "0.05 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.03 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "黑龙江",
        "腾讯": "0.05 ",
        "爱奇艺": "0.04 ",
        "阿里巴巴": "0.04 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "湖北",
        "腾讯": "0.24 ",
        "爱奇艺": "0.05 ",
        "阿里巴巴": "0.00 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "湖南",
        "腾讯": "0.01 ",
        "爱奇艺": "0.00 ",
        "阿里巴巴": "0.01 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "吉林",
        "腾讯": "0.04 ",
        "爱奇艺": "0.01 ",
        "阿里巴巴": "0.02 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "江苏",
        "腾讯": "0.19 ",
        "爱奇艺": "0.13 ",
        "阿里巴巴": "0.06 ",
        "优酷土豆网": "0.18 ",
        "百度": "0.00 ",
        "乐视网": "0.03 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.01 "
    },
    {
        "name": "江西",
        "腾讯": "0.00 ",
        "爱奇艺": "0.01 ",
        "阿里巴巴": "0.00 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "辽宁",
        "腾讯": "0.08 ",
        "爱奇艺": "0.05 ",
        "阿里巴巴": "0.00 ",
        "优酷土豆网": "0.05 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "内蒙古",
        "腾讯": "0.02 ",
        "爱奇艺": "0.00 ",
        "阿里巴巴": "0.00 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "宁夏",
        "腾讯": "0.02 ",
        "爱奇艺": "0.00 ",
        "阿里巴巴": "0.00 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "青海",
        "腾讯": "0.09 ",
        "爱奇艺": "0.10 ",
        "阿里巴巴": "0.03 ",
        "优酷土豆网": "0.08 ",
        "百度": "0.04 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.01 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "山东",
        "腾讯": "0.09 ",
        "爱奇艺": "0.10 ",
        "阿里巴巴": "0.03 ",
        "优酷土豆网": "0.08 ",
        "百度": "0.04 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.01 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "山西",
        "腾讯": "0.09 ",
        "爱奇艺": "0.00 ",
        "阿里巴巴": "0.00 ",
        "优酷土豆网": "0.01 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "陕西",
        "腾讯": "0.00 ",
        "爱奇艺": "0.00 ",
        "阿里巴巴": "0.00 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "上海",
        "腾讯": "0.25 ",
        "爱奇艺": "0.00 ",
        "阿里巴巴": "0.02 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.04 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "四川",
        "腾讯": "0.23 ",
        "爱奇艺": "0.08 ",
        "阿里巴巴": "0.06 ",
        "优酷土豆网": "0.03 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "天津",
        "腾讯": "0.05 ",
        "爱奇艺": "0.00 ",
        "阿里巴巴": "0.05 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.01 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "西藏",
        "腾讯": "0.00 ",
        "爱奇艺": "0.01 ",
        "阿里巴巴": "0.00 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "新疆",
        "腾讯": "0.02 ",
        "爱奇艺": "0.00 ",
        "阿里巴巴": "0.02 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.00 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "云南",
        "腾讯": "0.10 ",
        "爱奇艺": "0.08 ",
        "阿里巴巴": "0.07 ",
        "优酷土豆网": "0.04 ",
        "百度": "0.01 ",
        "乐视网": "0.07 ",
        "芒果TV": "0.06 ",
        "金山网络":"0.00",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    },
    {
        "name": "浙江",
        "腾讯": "0.16 ",
        "爱奇艺": "0.67 ",
        "阿里巴巴": "0.40 ",
        "优酷土豆网": "0.09 ",
        "百度": "0.10 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.00",
        "搜狐": "0.03 ",
        "新浪": "0.01 "
    },
    {
        "name": "重庆",
        "腾讯": "0.18 ",
        "爱奇艺": "0.07 ",
        "阿里巴巴": "0.04 ",
        "优酷土豆网": "0.00 ",
        "百度": "0.02 ",
        "乐视网": "0.00 ",
        "芒果TV": "0.00 ",
        "金山网络":"0.02",
        "搜狐": "0.00 ",
        "新浪": "0.00 "
    }
]

export const map3data = {
    "qsfx":{
        "day1":[
        {
            "id":null,
            "name":"付费直连",
            "ports":null,
            "bandwidth":null,
            "trafficins":14.884333276189864,
            "trafficouts":null,
            "creattime":null
        },
        {
            "id":null,
            "name":"付费穿透",
            "ports":null,
            "bandwidth":null,
            "trafficins":151.43117638491094,
            "trafficouts":null,
            "creattime":null
        },
        {
            "id":null,
            "name":"免费直连",
            "ports":null,
            "bandwidth":null,
            "trafficins":209.55132811050862,
            "trafficouts":null,
            "creattime":null
        },
        {
            "id":null,
            "name":"收费客户",
            "ports":null,
            "bandwidth":null,
            "trafficins":49.318800491280854,
            "trafficouts":null,
            "creattime":null
        }
    ], "day2":[
        {
            "id":null,
            "name":"付费直连",
            "ports":null,
            "bandwidth":null,
            "trafficins":13.844007070176303,
            "trafficouts":null,
            "creattime":null
        },
        {
            "id":null,
            "name":"付费穿透",
            "ports":null,
            "bandwidth":null,
            "trafficins":145.40155654866248,
            "trafficouts":null,
            "creattime":null
        },
        {
            "id":null,
            "name":"免费直连",
            "ports":null,
            "bandwidth":null,
            "trafficins":199.95969658438116,
            "trafficouts":null,
            "creattime":null
        },
        {
            "id":null,
            "name":"收费客户",
            "ports":null,
            "bandwidth":null,
            "trafficins":48.67041595187038,
            "trafficouts":null,
            "creattime":null
        }
    ],
    "day3":[
            {
                "id":null,
                "name":"付费直连",
                "ports":null,
                "bandwidth":null,
                "trafficins":13.84452684596181,
                "trafficouts":null,
                "creattime":null
            },
            {
            "id":null,
            "name":"付费穿透",
            "ports":null,
            "bandwidth":null,
            "trafficins":146.57219823729247,
            "trafficouts":null,
            "creattime":null
        },
        {
            "id":null,
            "name":"免费直连",
            "ports":null,
            "bandwidth":null,
            "trafficins":199.70833874307573,
            "trafficouts":null,
            "creattime":null
        },
        {
            "id":null,
            "name":"收费客户",
            "ports":null,
            "bandwidth":null,
            "trafficins":50.93750201910734,
            "trafficouts":null,
            "creattime":null
        }
    ],
        "day4":[
            {
                "id":null,
                "name":"付费直连",
                "ports":null,
                "bandwidth":null,
                "trafficins":14.137763816863298,
                "trafficouts":null,
                "creattime":null
            },
            {
                "id":null,
                "name":"付费穿透",
                "ports":null,
                "bandwidth":null,
                "trafficins":153.1071700779721,
                "trafficouts":null,
                "creattime":null
            },
            {
                "id":null,
                "name":"免费直连",
                "ports":null,
                "bandwidth":null,
                "trafficins":193.77205181960016,
                "trafficouts":null,
                "creattime":null
            },
            {
                "id":null,
                "name":"收费客户",
                "ports":null,
                "bandwidth":null,
                "trafficins":48.27645250316709,
                "trafficouts":null,
                "creattime":null
            }
        ],
        "day5":[
            {
                "id":null,
                "name":"付费直连",
                "ports":null,
                "bandwidth":null,
                "trafficins":14.280251594260335,
                "trafficouts":null,
                "creattime":null
            },
            {
                "id":null,
                "name":"付费穿透",
                "ports":null,
                "bandwidth":null,
                "trafficins":161.14539736974984,
                "trafficouts":null,
                "creattime":null
            },
            {
                "id":null,
                "name":"免费直连",
                "ports":null,
                "bandwidth":null,
                "trafficins":192.78201825823635,
                "trafficouts":null,
                "creattime":null
            },
            {
                "id":null,
                "name":"收费客户",
                "ports":null,
                "bandwidth":null,
                "trafficins":49.106433341279626,
                "trafficouts":null,
                "creattime":null
            }
        ],
        "day6":[
        {
            "id":null,
            "name":"付费直连",
            "ports":null,
            "bandwidth":null,
            "trafficins":13.835277570411563,
            "trafficouts":null,
            "creattime":null
        },
        {
            "id":null,
            "name":"付费穿透",
            "ports":null,
            "bandwidth":null,
            "trafficins":159.21641427464783,
            "trafficouts":null,
            "creattime":null
        },
        {
            "id":null,
            "name":"免费直连",
            "ports":null,
            "bandwidth":null,
            "trafficins":193.01009945943952,
            "trafficouts":null,
            "creattime":null
        },
        {
            "id":null,
            "name":"收费客户",
            "ports":null,
            "bandwidth":null,
            "trafficins":48.0795068917796,
            "trafficouts":null,
            "creattime":null
        }
    ],

        "day7":[
            {
                "id":261,
                "name":"付费直连",
                "ports":4,
                "bandwidth":27.939677238464355,
                "trafficins":15.308424747548997,
                "trafficouts":7.066142062656581,
                "creattime":1500739200000
            },
            {
                "id":262,
                "name":"付费穿透",
                "ports":25,
                "bandwidth":214.20419216156006,
                "trafficins":155.95026103407145,
                "trafficouts":19.97492234222591,
                "creattime":1500739200000
            },
            {
                "id":263,
                "name":"免费直连",
                "ports":91,
                "bandwidth":1013.2789611816406,
                "trafficins":209.7418288141489,
                "trafficouts":90.7635859278962,
                "creattime":1500739200000
            },
            {
                "id":264,
                "name":"收费客户",
                "ports":61,
                "bandwidth":458.3410918712616,
                "trafficins":49.089934423565865,
                "trafficouts":113.42032939288765,
                "creattime":1500739200000
            },
            {
                "id":265,
                "name":"省际直连",
                "ports":67,
                "bandwidth":575.4502490162849,
                "trafficins":203.66153841093183,
                "trafficouts":350.0188995739445,
                "creattime":1500739200000
            },
            {
                "id":266,
                "name":"统建CDN",
                "ports":8,
                "bandwidth":74.50580596923828,
                "trafficins":0.025197772309184074,
                "trafficouts":0.49813532177358866,
                "creattime":1500739200000
            }
        ],
}
}

export const map3 = {
    map1:{
        daikuan:[
            {
                name:'付费穿透',
                value: '31'
            },
            {
                name: '付费直连',
                value: '31'
            },
            {
                name: '免费直连',
                value: '32'
            },
            {
                name: '收费客户',
                value: '32'
            }
        ],
        liuliang:[
            {
                name:'付费穿透',
                value: '31'
            },
            {
                name: '付费直连',
                value: '31'
            },
            {
                name: '免费直连',
                value: '32'
            },
            {
                name: '收费客户',
                value: '32'
            }
        ]
    },
    map2:{
        name: '国际付费率',
        value: '67'
    },
    top10:{
        daikuan:[
            {
                name: '苹果',
                value: '160'
            }
        ],
        liuliang:[
            {
                name: '苹果',
                value: '160'
            }
        ]
    }
}
export const map4 = {
    yongse:[
        {
            name:'腾讯',
            value: '34'
        },
        {
            name:'爱奇艺',
            value: '23'
        }
    ],
    icp_yongse:{
        line1:[1,2,3,4,5,6],
        line2:[1,2,3,4,5,6]
    },
    reset:[
        {
            name:'腾讯',
            value: '34'
        },
        {
            name:'爱奇艺',
            value: '23'
        }
    ],
    map:[
        {
            name: '腾讯',
            province:[
                {
                    name:'安徽',
                    value: '33'
                }
            ]
        },
        {
            name:'爱奇艺',
            province:[
                {
                    name:'安徽',
                    value: '44'
                }
            ]
        }
    ]

}

export const map7lyl={
    "lyl":[
        {
                "name": "全国",
                "value": "37"
        },
        {
            "name": "安徽",
            "value": "22"
        },
        {
            "name": "北京",
            "value": "4"
        },
        {
            "name": "福建",
            "value": "56"
        },
        {
            "name": "甘肃",
            "value": "12"
        },
        {
            "name": "广东",
            "value": "14"
        },
        {
            "name": "广西",
            "value": "30"
        },
        {
            "name": "贵州",
            "value": "57"
        },
        {
            "name": "海南",
            "value": "80"
        },
        {
            "name": "河北",
            "value": "47"
        },
        {
            "name": "河南",
            "value": "48"
        },
        {
            "name": "黑龙江",
            "value": "37"
        },
        {
            "name": "湖北",
            "value": "36"
        },
        {
            "name": "湖南",
            "value": "71"
        },
        {
            "name": "吉林",
            "value": "14"
        },
        {
            "name": "江苏",
            "value": "15"
        },
        {
            "name": "江西",
            "value": "47"
        },
        {
            "name": "辽宁",
            "value": "52"
        },
        {
            "name": "内蒙古",
            "value": "6"
        },
        {
            "name": "宁夏",
            "value": "47"
        },
        {
            "name": "青海",
            "value": "65"
        },
        {
            "name": "山东",
            "value": "43"
        },
        {
            "name": "山西",
            "value": "24"
        },
        {
            "name": "陕西",
            "value": "7"
        },
        {
            "name": "上海",
            "value": "10"
        },
        {
            "name": "四川",
            "value": "55"
        },
        {
            "name": "天津",
            "value": "57"
        },
        {
            "name": "西藏",
            "value": "17"
        },
        {
            "name": "新疆",
            "value": "11"
        },
        {
            "name": "云南",
            "value": "49"
        },
        {
            "name": "浙江",
            "value": "81"
        },
        {
            "name": "重庆",
            "value": "47"
        }
    ]
}
export const map7jsrl={
    "jsrl": [
        {
            "name": "全国",
            "value": "34.9 "
        },
        {
            "name": "安徽",
            "value": "0.9 "
        },
        {
            "name": "北京",
            "value": "0.9 "
        },
        {
            "name": "福建",
            "value": "1.2 "
        },
        {
            "name": "甘肃",
            "value": "0.8 "
        },
        {
            "name": "广东",
            "value": "0.7 "
        },
        {
            "name": "广西",
            "value": "2.4 "
        },
        {
            "name": "贵州",
            "value": "1.2 "
        },
        {
            "name": "海南",
            "value": "0.1 "
        },
        {
            "name": "河北",
            "value": "1.0 "
        },
        {
            "name": "河南",
            "value": "0.3 "
        },
        {
            "name": "黑龙江",
            "value": "0.7 "
        },
        {
            "name": "湖北",
            "value": "2.3 "
        },
        {
            "name": "湖南",
            "value": "0.1 "
        },
        {
            "name": "吉林",
            "value": "1.5 "
        },
        {
            "name": "江苏",
            "value": "0.2 "
        },
        {
            "name": "江西",
            "value": "0.3 "
        },
        {
            "name": "辽宁",
            "value": "2.0 "
        },
        {
            "name": "内蒙古",
            "value": "0.3 "
        },
        {
            "name": "宁夏",
            "value": "10.2 "
        },
        {
            "name": "青海",
            "value": "0.3 "
        },
        {
            "name": "山东",
            "value": "0.5 "
        },
        {
            "name": "山西",
            "value": "0.1 "
        },
        {
            "name": "陕西",
            "value": "0.3 "
        },
        {
            "name": "上海",
            "value": "0.6 "
        },
        {
            "name": "四川",
            "value": "0.3 "
        },
        {
            "name": "天津",
            "value": "0.4 "
        },
        {
            "name": "西藏",
            "value": "0.9 "
        },
        {
            "name": "新疆",
            "value": "0.2 "
        },
        {
            "name": "云南",
            "value": "0.2 "
        },
        {
            "name": "浙江",
            "value": "3.1 "
        },
        {
            "name": "重庆",
            "value": "0.7 "
        }
    ]
}
export const map7byjd = {
    "byjd": [
        {
            "name": "安徽",
            "value": "1"
        },
        {
            "name": "北京",
            "value": "1"
        },
        {
            "name": "广西",
            "value": "1"
        },
        {
            "name": "贵州",
            "value": "1"
        },
        {
            "name": "海南",
            "value": "1"
        },
        {
            "name": "湖北",
            "value": "1"
        },
        {
            "name": "江苏",
            "value": "1"
        },
        {
            "name": "辽宁",
            "value": "1"
        },
        {
            "name": "内蒙古",
            "value": "1"
        },
        {
            "name": "宁夏",
            "value": "1"
        },
        {
            "name": "青海",
            "value": "1"
        },
        {
            "name": "陕西",
            "value": "1"
        },
        {
            "name": "上海",
            "value": "1"
        },
        {
            "name": "四川",
            "value": "1"
        },
        {
            "name": "天津",
            "value": "1"
        },
        {
            "name": "西藏",
            "value": "1"
        },
        {
            "name": "新疆",
            "value": "1"
        },
        {
            "name": "云南",
            "value": "1"
        },
        {
            "name": "福建",
            "value": "2"
        },
        {
            "name": "河北",
            "value": "2"
        },
        {
            "name": "黑龙江",
            "value": "2"
        },
        {
            "name": "重庆",
            "value": "2"
        },
        {
            "name": "山东",
            "value": "4"
        },
        {
            "name": "浙江",
            "value": "7"
        },
        {
            "name": "广东",
            "value": "8"
        },
        {
            "name": "吉林",
            "value": "9"
        },
        {
            "name": "河南",
            "value": "10"
        },
        {
            "name": "湖南",
            "value": "10"
        },
        {
            "name": "山西",
            "value": "11"
        },
        {
            "name": "江西",
            "value": "23"
        },
        {
            "name": "甘肃",
            "value": "24"
        },
        {
            "name": "全国",
            "value": "132"
        },

    ]
}

